Обработки/Reports/_ОтчетОФактахИнвестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОФактахИнвестирования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОФактахИнвестирования/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.ПутьКФайлу	= "\\g1\shares\1Cv8\AM\DataExchange\ReportOnInvestmentFacts\Issuers.xlsx";
	Отчет.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	Отчет.Подписант = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(Подписант, Отчет.Организация);
	
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписанта(Подписант, Отчет.Подписант, Отчет.Организация)
		Или Не ЗначениеЗаполнено(Подписант) Тогда
		РаботаСОтчетамиКлиентСервер.ЗаполнитьПодписанта(ЭтаФорма, Отчет.Организация); 		
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Таблицы EXCEL (*.xlsx)|*.xlsx";

	Если Не ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Отчет.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОтчетаНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОтчетаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)

	РаботаСОтчетамиКлиент.ПодписантОтчетаПриИзменении(ЭтаФорма);
	
	Отчет.Подписант = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(Подписант, Отчет.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Отчет.ПутьКФайлу);
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(ЭтаФорма.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Период");
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(Отчет.ПутьКФайлу);
	Если НЕ Файл.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран файл ИНН-ов эмитентов!",,, "ПутьКФайлу");
		Возврат;
	КонецЕсли;
	
	СоответствиеИННКлиентов = ПолучитьСоответствиеИНН(Файл.ПолноеИмя);
	
	Отчет.НачалоПериода = Период.ДатаНачала;
	Отчет.КонецПериода	= Период.ДатаОкончания;
	
	СформироватьНаСервере(СоответствиеИННКлиентов);
	
КонецПроцедуры

#КонецОбласти

 #Область Служебные_процедуры_и_функции
 
&НаСервере
Процедура СформироватьНаСервере(СоответствиеИННКлиентов)
	
	РеквизитФормыВЗначение("Отчет").Сформировать(Результат, СоответствиеИННКлиентов);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСоответствиеИНН(ПолноеИмяФайла)
	
	СоответствиеИННКлиентов = Новый Соответствие;
	
	Excel = Новый COMОбъект("Excel.Application");
	Excel.WorkBooks.Open(ПолноеИмяФайла);
	
	КоличествоСтраниц = Excel.Sheets.Count;
	
	Для НомерСтраницы = 1 По КоличествоСтраниц Цикл
		ИмяСтраницы = Excel.Sheets(НомерСтраницы).Name;
		
		Попытка 
			ДатаСоответствия = Дата(СокрЛП(ИмяСтраницы + " 0:00:00"));
		Исключение
			ВызватьИсключение "Имя страницы """ + ИмяСтраницы + """ не является датой!";
		КонецПопытки;
		
		Excel.Sheets(НомерСтраницы).Select();
		
		НомерСтроки = 1;
		КоличествоПопыток = 0;
		ИННКлиента	= Формат(Excel.Cells(НомерСтроки, 1).Value, "ЧГ=0");
		ИННЭмитента	= Формат(Excel.Cells(НомерСтроки, 2).Value, "ЧГ=0");
		
		Пока КоличествоПопыток <= 10 Цикл
		//Пока ЗначениеЗаполнено(ИННКлиента) И ЗначениеЗаполнено(ИННЭмитента) Цикл
			НомерСтроки = НомерСтроки + 1;
			ИННКлиента	= Формат(Excel.Cells(НомерСтроки, 1).Value, "ЧГ=0");
			ИННЭмитента	= Формат(Excel.Cells(НомерСтроки, 2).Value, "ЧГ=0");
			
			Если НЕ ЗначениеЗаполнено(ИННКлиента) ИЛИ НЕ ЗначениеЗаполнено(ИННЭмитента) Тогда
				КоличествоПопыток = КоличествоПопыток + 1;
				Продолжить;
			Иначе
				КоличествоПопыток = 0;
			КонецЕсли;
		
			СоответствиеДат = СоответствиеИННКлиентов.Получить(ИННКлиента);
			Если СоответствиеДат = Неопределено Тогда
				СоответствиеДат = Новый Соответствие;
			КонецЕсли;
			
			МассивИННЭмитентов = СоответствиеДат.Получить(ДатаСоответствия);
			Если МассивИННЭмитентов = Неопределено Тогда
				МассивИННЭмитентов = Новый Массив;
			КонецЕсли;
			
			МассивИННЭмитентов.Добавить(ИННЭмитента);
			
			СоответствиеДат.Вставить(ДатаСоответствия, МассивИННЭмитентов);
			СоответствиеИННКлиентов.Вставить(ИННКлиента, СоответствиеДат);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Excel.ActiveWorkbook.Close();	
	
	Возврат СоответствиеИННКлиентов;
	
КонецФункции

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписанта(Подписант, Отчет.Подписант, Отчет.Организация)
		Или Не ЗначениеЗаполнено(Подписант) Тогда
		РаботаСОтчетамиКлиентСервер.ЗаполнитьПодписанта(ЭтаФорма, Отчет.Организация); 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
